defIn /home/p/paschalk/Desktop/I2C_Memory/flows/genus/Genus_Out_Innovus/Test/I2CAndMemory.scan.def


===========Secify Floorplan=============
getIoFlowFlag
setIoFlowFlag 0
floorPlan -site core_hd -r 0.922495274102 0.75 15 15 15 15
uiSetTool select
getIoFlowFlag
fit

============Power Core Ring============================
set sprCreateIeRingOffset 1.0
set sprCreateIeRingThreshold 1.0
set sprCreateIeRingJogDistance 1.0
set sprCreateIeRingLayers {}
set sprCreateIeRingOffset 1.0
set sprCreateIeRingThreshold 1.0
set sprCreateIeRingJogDistance 1.0
set sprCreateIeRingLayers {}
set sprCreateIeStripeWidth 10.0
set sprCreateIeStripeThreshold 1.0
set sprCreateIeStripeWidth 10.0
set sprCreateIeStripeThreshold 1.0
set sprCreateIeRingOffset 1.0
set sprCreateIeRingThreshold 1.0
set sprCreateIeRingJogDistance 1.0
set sprCreateIeRingLayers {}
set sprCreateIeStripeWidth 10.0
set sprCreateIeStripeThreshold 1.0
setAddRingMode -ring_target default -extend_over_row 0 -ignore_rows 0 -avoid_short 0 -skip_crossing_trunks none -stacked_via_top_layer METTPL -stacked_via_bottom_layer MET1 -via_using_exact_crossover_size 1 -orthogonal_only true -skip_via_on_pin {  standardcell } -skip_via_on_wire_shape {  noshape }
addRing -nets {vdd gnd} -type core_rings -follow core -layer {top METTP bottom METTP left METTPL right METTPL} -width {top 3 bottom 3 left 3 right 3} -spacing {top 3 bottom 3 left 3 right 3} -offset {top 1.8 bottom 1.8 left 1.8 right 1.8} -center 1 -threshold 0 -jog_distance 0 -snap_wire_center_to_grid None

============Power Stripes============================
set sprCreateIeRingOffset 1.0
set sprCreateIeRingThreshold 1.0
set sprCreateIeRingJogDistance 1.0
set sprCreateIeRingLayers {}
set sprCreateIeRingOffset 1.0
set sprCreateIeRingThreshold 1.0
set sprCreateIeRingJogDistance 1.0
set sprCreateIeRingLayers {}
set sprCreateIeStripeWidth 10.0
set sprCreateIeStripeThreshold 1.0
set sprCreateIeStripeWidth 10.0
set sprCreateIeStripeThreshold 1.0
set sprCreateIeRingOffset 1.0
set sprCreateIeRingThreshold 1.0
set sprCreateIeRingJogDistance 1.0
set sprCreateIeRingLayers {}
set sprCreateIeStripeWidth 10.0
set sprCreateIeStripeThreshold 1.0
setAddStripeMode -ignore_block_check false -break_at none -route_over_rows_only false -rows_without_stripes_only false -extend_to_closest_target none -stop_at_last_wire_for_area false -partial_set_thru_domain false -ignore_nondefault_domains false -trim_antenna_back_to_shape none -spacing_type edge_to_edge -spacing_from_block 0 -stripe_min_length stripe_width -stacked_via_top_layer METTPL -stacked_via_bottom_layer MET1 -via_using_exact_crossover_size false -split_vias false -orthogonal_only true -allow_jog { padcore_ring  block_ring } -skip_via_on_pin {  standardcell } -skip_via_on_wire_shape {  noshape   }
addStripe -nets {vdd gnd} -layer METTPL -direction vertical -width 3 -spacing 3 -number_of_sets 3 -start_from left -start_offset 30 -stop_offset 30 -switch_layer_over_obs false -max_same_layer_jog_length 2 -padcore_ring_top_layer_limit METTPL -padcore_ring_bottom_layer_limit MET1 -block_ring_top_layer_limit METTPL -block_ring_bottom_layer_limit MET1 -use_wire_group 0 -snap_wire_center_to_grid None


#=========Power Pins============

globalNetConnect vdd -type pgpin -pin vdd -inst *
globalNetConnect vdd -type tiehi -instanceBasename *
globalNetConnect gnd -type pgpin -pin gnd -inst *   
globalNetConnect gnd -type tielo -instanceBasename *
createPGPin vdd -net vdd -geom METTPL  9.06 0 12.06 12.06
createPGPin gnd -net gnd -geom METTPL  3.06 0 6.06 6.06

==================S Route=============================

setSrouteMode -viaConnectToShape { stripe }
sroute -connect { blockPin padPin padRing corePin floatingStripe } -layerChangeRange { MET1(1) METTPL(6) } -blockPinTarget { nearestTarget } -padPinPortConnect { allPort oneGeom } -padPinTarget { nearestTarget } -corePinTarget { firstAfterRowEnd } -floatingStripeTarget { blockring padring ring stripe ringpin blockpin followpin } -allowJogging 1 -crossoverViaLayerRange { MET1(1) METTPL(6) } -nets { vdd gnd } -allowLayerChange 1 -blockPin useLef -targetViaLayerRange { MET1(1) METTPL(6) }

saveDesign Saved_Designs/Top_1_Pre_Place.enc

#=========Place============
defIn

setRouteMode -earlyGlobalHonorMsvRouteConstraint false -earlyGlobalRoutePartitionPinGuide true
setEndCapMode -reset
setEndCapMode -boundary_tap false
setNanoRouteMode -quiet -droutePostRouteSpreadWire 1
setNanoRouteMode -quiet -timingEngine {}
setUsefulSkewMode -noBoundary false -maxAllowedDelay 1
setPlaceMode -reset
setPlaceMode -congEffort high -timingDriven 1 -clkGateAware 1 -powerDriven 0 -ignoreScan 1 -reorderScan 1 -ignoreSpare 0 -placeIOPins 1 -moduleAwareSpare 0 -preserveRouting 1 -rmAffectedRouting 0 -checkRoute 0 -swapEEQ 0
setDesignMode -process 180
getPlaceMode
place_opt_design -out_dir Post_Place/Place_Opt

report_power -output Post_Place/ -outfile Post_Place/Place_power.txt
report_timing > Post_Place/Place_timing.txt
report_area > Post_Place/Place_area.txt
checkPlace > Post_Place/Place_check_placement.txt
saveDesign Saved_Designs/Top_2_Post_Place_Pre_GRoute.enc

#=========Early Global Route============
setRouteMode -earlyGlobalMinRouteLayer 2 -earlyGlobalMaxRouteLayer 6 -earlyGlobalHonorMsvRouteConstraint true -earlyGlobalRoutePartitionPinGuide true
earlyGlobalRoute

report_power -output Post_GRoute/ -outfile Post_GRoute/GRoute_power.txt
report_area > Post_GRoute/GRoute_area.txt
report_timing > Post_GRoute/GRoute_timing.txt
reportCongestion -hotSpot > Post_GRoute/Congestion/GRoute_hotspot.txt
reportCongestion -overflow > Post_GRoute/Congestion/GRoute_overflow.txt
saveDesign Saved_Designs/Top_3_Post_GRoute_Pre_CTS.enc

#=========Clock Tree Synthesis Global Route============
#-shield_net gnd // add shilding with gnd you can put vdd also
#-shield_side both_side // to both sides can also be single side
#maybe put skew 0.4
#also maybe change top and bottom layers

add_ndr -width {MET1 0.46 MET2 0.56 MET3 0.56 MET4 0.56 METTP 0.88 METTPL 6.0 } -name NDR_1

create_route_type -top_preferred_layer 6 -bottom_preferred_layer 5 -non_default_rule NDR_1 -name t_route -preferred_routing_layer_effort high
set_ccopt_property -net_type trunk -route_type t_route
set_ccopt_property target_skew 0.4
set_ccopt_property target_max_trans 0.6
create_route_type -top_preferred_layer 4 -bottom_preferred_layer 3 -name l_route -preferred_routing_layer_effort high
set_ccopt_property -net_type leaf -route_type l_route
set_ccopt_property target_skew 0.4
set_ccopt_property target_max_trans 0.6

create_ccopt_clock_tree_spec -file Post_CTS/Clock_Tree_Spec/clock.spec
ccopt_design -outDir Post_CTS/Ccopt_Design_Timing_Reports

optDesign -postCTS -outDir Post_CTS/CTS_Opt_Design/

report_power -output Post_CTS/ -outfile Post_CTS/CTS_power.txt
report_area > Post_CTS/CTS_area.txt
report_timing > Post_CTS/CTS_timing.txt
report_ccopt_clock_trees > Post_CTS/CTS_clock_trees.txt
report_ccopt_skew_groups > Post_CTS/CTS_skew_groups.txt
saveDesign Saved_Designs/Top_4_Post_CTS_Pre_NRoute.enc

#================Nano Route=============
setNanoRouteMode -routeTopRoutingLayer 6
setNanoRouteMode -routeBottomRoutingLayer 1
setNanoRouteMode -drouteEndIteration default
setNanoRouteMode -routeWithTimingDriven true
setNanoRouteMode -routeWithSiDriven true
setNanoRouteMode -drouteUseMultiCutViaEffort medium
setNanoRouteMode -drouteFixAntenna true
setNanoRouteMode -routeInsertAntennaDiode true
setNanoRouteMode -routeAntennaCellName {ANTENNACELLN2HD ANTENNACELLNP2HD ANTENNACELLP2HD}
routeDesign -globalDetail

setDelayCalMode -engine aae -SIAware true
setAnalysisMode -analysisType onChipVariation -cppr both
optDesign -postRoute -setup -hold -outDir Post_NRoute/NRoute_Opt_Design/

report_power -output Post_NRoute/ -outfile Post_NRoute/NRoute_power.txt
report_area > Post_NRoute/NRoute_area.txt
report_timing > Post_NRoute/NRoute_timing.txt
report_ccopt_clock_trees > Post_NRoute/NRoute_clock_trees.txt
report_ccopt_skew_groups > Post_NRoute/NRoute_skew_groups.txt



====================Verify Drc Post Route==========================
get_verify_drc_mode -disable_rules -quiet
get_verify_drc_mode -quiet -area
get_verify_drc_mode -quiet -layer_range
get_verify_drc_mode -check_ndr_spacing -quiet
get_verify_drc_mode -check_only -quiet
get_verify_drc_mode -check_same_via_cell -quiet
get_verify_drc_mode -exclude_pg_net -quiet
get_verify_drc_mode -ignore_trial_route -quiet
get_verify_drc_mode -max_wrong_way_halo -quiet
get_verify_drc_mode -use_min_spacing_on_block_obs -quiet
get_verify_drc_mode -limit -quiet
set_verify_drc_mode -disable_rules {} -check_ndr_spacing auto -check_only default -check_same_via_cell true -exclude_pg_net false -ignore_trial_route false -ignore_cell_blockage false -use_min_spacing_on_block_obs auto -report Verify_Post_Route/I2CAndMemory.drc.rpt -limit 1000
verify_drc -report Post_NRoute/Verify_Post_NRoute/I2CAndMemory.drc.rpt


=====================Verify Connectivity Post Route===========================
set_verify_drc_mode -area {0 0 0 0}
get_verify_drc_mode -disable_rules -quiet
get_verify_drc_mode -quiet -area
get_verify_drc_mode -quiet -layer_range
get_verify_drc_mode -check_ndr_spacing -quiet
get_verify_drc_mode -check_only -quiet
get_verify_drc_mode -check_same_via_cell -quiet
get_verify_drc_mode -exclude_pg_net -quiet
get_verify_drc_mode -ignore_trial_route -quiet
get_verify_drc_mode -max_wrong_way_halo -quiet
get_verify_drc_mode -use_min_spacing_on_block_obs -quiet
get_verify_drc_mode -limit -quiet
verifyConnectivity -type all -report Post_NRoute/Verify_Post_NRoute/I2CAndMemory.conn.rpt -error 1000 -warning 50

======================Verify Antenna=======================================
verifyProcessAntenna -report Post_NRoute/Verify_Post_NRoute/I2CAndMemory.antenna.rpt -detailed -error 1000


======================Metal Fill Post NRoute=============================
setMetalFill -layer MET1 -opcActiveSpacing 0.230 -minDensity 10.00
setMetalFill -layer MET2 -opcActiveSpacing 0.280 -minDensity 10.00
setMetalFill -layer MET3 -opcActiveSpacing 0.280 -minDensity 10.00
setMetalFill -layer MET4 -opcActiveSpacing 0.280 -minDensity 10.00
setMetalFill -layer METTP -opcActiveSpacing 0.460 -minDensity 10.00
setMetalFill -layer METTPL -opcActiveSpacing 2.500 -minDensity 10.00
addMetalFill -layer { MET1 MET2 MET3 MET4 METTP METTPL } -net { gnd vdd } > Post_NRoute/Verify_Post_NRoute/I2CAndMemory.Metal_Fill.rpt


=====================Verify Metal Fill Post NRoute===========================

setMetalFill -layer MET1 -windowSize 100.000 100.000 -windowStep 50.000 10.000 -minDensity 10.000 -maxDensity 80.000
setMetalFill -layer MET2 -windowSize 100.000 100.000 -windowStep 50.000 10.000 -minDensity 10.000 -maxDensity 80.000
setMetalFill -layer MET3 -windowSize 100.000 100.000 -windowStep 50.000 10.000 -minDensity 10.000 -maxDensity 80.000
setMetalFill -layer MET4 -windowSize 100.000 100.000 -windowStep 50.000 10.000 -minDensity 10.000 -maxDensity 80.000
setMetalFill -layer METTP -windowSize 100.000 100.000 -windowStep 50.000 10.000 -minDensity 10.000 -maxDensity 80.000
setMetalFill -layer METTPL -windowSize 100.000 100.000 -windowStep 50.000 10.000 -minDensity 10.000 -maxDensity 80.000
verifyMetalDensity -report Post_NRoute/Verify_Post_NRoute/I2CAndMemory.density.rpt

saveDesign Saved_Designs/Top_5_Post_NRoute_Pre_Sign_Off.enc

======================Sign OFF==============================
setMultiCpuUsage -remoteHost 4
setExtractRCMode -engine postRoute -effortLevel high -localCpu 4
extractRC
setExtractRCMode -engine postRoute -effortLevel signoff -coupled true -lefTechFileMap [glob -nocomplain extLogDir/extr.I2CAndMemory.layermap.log] -localCpu 4
signoffTimeDesign -noEcoDb


=================ANTENNA CELLS=============================
ANTENNACELLN2HD cell_description : "protection cell against antenna effects (net charge) at manufacture, NIMP diode in substrate";
ANTENNACELLNP2HD cell_description : "protection cell against antenna effects (net charge) at manufacture, PIMP diode in NWELL, NIMP diode in substrate";
ANTENNACELLP2HD  cell_description : "protection cell against antenna effects (net charge) at manufacture, PIMP diode in NWELL";



#======================Power Rail Analysis========================

set_power_analysis_mode -reset
set_power_analysis_mode -method static -analysis_view PVT_1_80_V_WC_VIEW -corner max -create_binary_db true -write_static_currents true -honor_negative_energy true -ignore_control_signals true
set_power_output_dir -reset
set_power_output_dir ${REPORTS_DIR}/Power_Analysis/
set_default_switching_activity -reset
set_default_switching_activity -input_activity 0.2 -period 10.0
read_activity_file -reset
set_power -reset
set_powerup_analysis -reset
set_dynamic_power_simulation -reset
report_power -rail_analysis_format VS -outfile ${REPORTS_DIR}/Power_Analysis/I2CAndMemory_power.rpt
set_rail_analysis_mode -method era_static -power_switch_eco false -generate_movies false -save_voltage_waveforms false -accuracy xd -analysis_view PVT_1_80_V_WC_VIEW -process_techgen_em_rules false -enable_rlrp_analysis false -extraction_tech_file Libs/QRS_PVS/Max/qrcTechFile -vsrc_search_distance 50 -ignore_shorts false -enable_manufacturing_effects false -report_via_current_direction false
setDrawView place
create_power_pads -net vdd -auto_fetch
setDrawView place
create_power_pads -net vdd -vsrc_file ${REPORTS_DIR}/Rail_Analysis/I2CAndMemory_vdd.pp
set_pg_nets -net vdd -voltage 1.8 -threshold 1.62
set_power_data -reset
set_power_data -format current -scale 1 ${REPORTS_DIR}/Power_Analysis/static_vdd.ptiavg
set_power_pads -reset
set_power_pads -net vdd -format xy -file ${REPORTS_DIR}/Rail_Analysis/I2CAndMemory_vdd.pp
set_package -reset
set_package -spice {} -mapping {}
set_net_group -reset
set_advanced_rail_options -reset
analyze_rail -type net -results_directory ${REPORTS_DIR}/Rail_Analysis vdd
setLayerPreference powerNet -color {#0000FF #0010DE #0020BD #00319C #00417B #00525A #006239 #007318 #088300 #299400 #4AA400 #6AB400 #8BC500 #ACD500 #CDE600 #EEF600 #FFF900 #FFED00 #FFE200 #FFD600 #FFCB00 #FFBF00 #FFB400 #FFA800 #FF9500 #FF8000 #FF6A00 #FF5500 #FF4000 #FF2A00 #FF1500 #FF0000}
set_power_rail_display -plot none
setLayerPreference powerNet -color {#0000ff #0010de #0020bd #00319c #00417b #00525a #006239 #007318 #088300 #299400 #4aa400 #6ab400 #8bc500 #acd500 #cde600 #eef600 #fff900 #ffed00 #ffe200 #ffd600 #ffcb00 #ffbf00 #ffb400 #ffa800 #ff9500 #ff8000 #ff6a00 #ff5500 #ff4000 #ff2a00 #ff1500 #ff0000}
set_power_rail_display -enable_voltage_sources 0
set_power_rail_display -enable_percentage_range 0
fit
::read_power_rail_results -power_db Innovus_Results/Test/Power_Analysis/power.db -rail_directory Innovus_Results/Test/Rail_Analysis/vdd_25C_avg_1 -instance_voltage_window { timing  whole  } -instance_voltage_method {  worst  best  avg  worstavg worstslidingavg bestslidingavg }
::read_power_rail_results -power_db Innovus_Results/Test/Power_Analysis/power.db -rail_directory Innovus_Results/Test/Rail_Analysis/vdd_25C_avg_1 -instance_voltage_window { timing  whole  } -instance_voltage_method {  worst  best  avg  worstavg worstslidingavg bestslidingavg }



==========HELPFULL COMMANDS========================
report_timing -late > 
report_timing -early >
report_timing -early -view  PVT_1_80_V_BC_VIEW >
report_timing -late -view  PVT_1_80_V_WC_VIEW >   
route_fix_ir
saveNetlist Results/Test/Netlist/I2CAndMemory_innovus.v // Save netlist
streamOut Results/Test/GDS/I2CAndMemory_GDS.gds -libName DesignLib -units 1000 -mode ALL // gds
#read_dft_abstract_model ${SCAN_DEF_DIR}/dft_abs_model.tcl

-drouteFixAntennaWithGAFillerMode {true|false}
              When enabled, the NanoRoute routers detects  the  GA  filler
              flow  and  uses the GA filler diode cells for antenna viola-
              tion fixing.


-drouteSearchAndRepair {true | false}
              Runs  a  search-and-repair  step  after the initial detailed
              routing (end iteration 20).

              Tip: Specify false for this parameter and run detailed rout-
              ing to determine quickly if the design is routable.

              Default: true

              Data_type: bool
              
-routeInsertAntennaDiode {true | false}
              Inserts and places antenna diode cells if there  are  avail-
              able  placement  locations. By default, the NanoRoute router
              repairs antenna violations by changing layers  (also  called
              antenna  stapling  or layer hopping), but it can also repair
              antenna violations by inserting diode cells as close as pos-
              sible  to  input  gates to discharge current. The router in-
              serts antenna diode cells even if filler cells  are  already
              placed.  It  can  swap filler cells with antenna diode cells
              and fill the gap automatically if an antenna diode  cell  is
              not the same size as the filler cell it replaced.

              To specify the diode cells, use -routeAntennaCellName.

              Default: false

              Data_type: bool
              
routeDesign 
	      Runs routing or postroute via or wire optimization using the
	      NanoRoute router. If you specify this command without any ar
	      guments,it runs global and detailed routing.The routeDesign 
	      command has the following characteristics:
	      
detailRoute 

	      Description
              Uses the NanoRoute router to perform detailed routing on the
              entire design, an area of the design specified by the boundi
              ng box, or on selected nets. If you do not specify param-ete
              rs, the router routes the entire design. If you specify both
              the bounding box and selected nets, the router routes only s
              elected nets within the bounding box. You can  perform detai
              led  routing  on specified area only if you are rerouting th
              e design. If you have not already run detailed routing on th
              e entire design, you cannot run detailed routing on aspecifi
              ed area.


25 verify/geometry violations
which 19 short metal and 6 parallel run length


49 nanoroute violations
which 18 metal short
6 Parallel Run lenght
25 Antena Side Area ratio

Did ecoRoute nothing cahnged form ecoRoute
Did optDesign nothing helped from optDesign
Did 
setNanoRouteMode -drouteUseMultiCutViaEffort medium
setNanoRouteMode -drouteFixAntenna true
setNanoRouteMode -routeInsertAntennaDiode true
setNanoRouteMode -routeAntennaCellName "ANTENNACELLNP2HD"
routeDesign -globalDetail

now verify/geometry errors dissapeared.
and we have 21 nanoroute violations
for short metal 15 
for Paraller Run Length Spacing 6

did ecoROute changed nothing
did ecoRoute -fix_drc 


