# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name MIN_RC -cap_table {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/cadence/v7_0/capTbl/v7_0_2/xh018_xx43_MET4_METMID_METTHK_min.capTbl} -T {-40.0} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {1.0 1.0 1.0} -postRoute_clkcap {1.0 1.0 1.0} -qx_tech_file {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/cadence/v7_0/QRC_pvs/v7_0_1_1/XH018_1143/QRC-Min/qrcTechFile}
create_rc_corner -name TYP_RC -cap_table {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/cadence/v7_0/capTbl/v7_0_2/xh018_xx43_MET4_METMID_METTHK_typ.capTbl} -T {25.0} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {1.0 1.0 1.0} -postRoute_clkcap {1.0 1.0 1.0} -qx_tech_file {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/cadence/v7_0/QRC_pvs/v7_0_1_1/XH018_1143/QRC-Typ/qrcTechFile}
create_rc_corner -name MAX_RC -cap_table {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/cadence/v7_0/capTbl/v7_0_2/xh018_xx43_MET4_METMID_METTHK_max.capTbl} -T {175} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {1.0 1.0 1.0} -postRoute_clkcap {1.0 1.0 1.0} -qx_tech_file {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/cadence/v7_0/QRC_pvs/v7_0_1_1/XH018_1143/QRC-Max/qrcTechFile}
create_op_cond -name PVT_1_80_V_BC_OC -library_file {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/D_CELLS_HD/v3_0/liberty_LPMOS/v3_0_0/PVT_1_80V_range/D_CELLS_HD_LPMOS_fast_1_98V_m40C.lib} -P {1} -V {1.98} -T {-40.0}
create_op_cond -name PVT_1_80_V_TYP_OC -library_file {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/D_CELLS_HD/v3_0/liberty_LPMOS/v3_0_0/PVT_1_80V_range/D_CELLS_HD_LPMOS_typ_1_80V_25C.lib} -P {1} -V {1.8} -T {25}
create_op_cond -name PVT_1_80_V_WC_OC -library_file {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/D_CELLS_HD/v3_0/liberty_LPMOS/v3_0_0/PVT_1_80V_range/D_CELLS_HD_LPMOS_slow_1_62V_175C.lib} -P {1} -V {1.62} -T {175}
create_library_set -name PVT_1_80_V_BC_LIBS -timing {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/D_CELLS_HD/v3_0/liberty_LPMOS/v3_0_0/PVT_1_80V_range/D_CELLS_HD_LPMOS_fast_1_98V_m40C.lib /mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/IO_CELLS_3V/v2_1/liberty_LPMOS/v2_1_0/PVT_1_80V_3_30V_range/IO_CELLS_3V_LPMOS_fast_1_98V_3_60V_m40C.lib}
create_library_set -name PVT_1_80_V_TYP_LIBS -timing {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/D_CELLS_HD/v3_0/liberty_LPMOS/v3_0_0/PVT_1_80V_range/D_CELLS_HD_LPMOS_typ_1_80V_25C.lib /mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/IO_CELLS_3V/v2_1/liberty_LPMOS/v2_1_0/PVT_1_80V_3_30V_range/IO_CELLS_3V_LPMOS_typ_1_80V_3_30V_25C.lib}
create_library_set -name PVT_1_80_V_WC_LIBS -timing {/mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/D_CELLS_HD/v3_0/liberty_LPMOS/v3_0_0/PVT_1_80V_range/D_CELLS_HD_LPMOS_slow_1_62V_175C.lib /mnt/apps/prebuilt/eda/designkits/xfab/XKIT/x_all/cadence/XFAB_AMS_RefKit-cadence_IC61/v2_5_1/pdk/xh018/diglibs/IO_CELLS_3V/v2_1/liberty_LPMOS/v2_1_0/PVT_1_80V_3_30V_range/IO_CELLS_3V_LPMOS_slow_1_62V_3_00V_175C.lib}
create_constraint_mode -name bc_mode -sdc_files {../genus/Genus_Results/MMMC/Genus_Out_Innovus/I2CAndMemory.bc_mode.sdc ../genus/Genus_Results/MMMC/Genus_Out_Innovus/I2CAndMemory.PVT_1_80_V_BC_VIEW_latency.sdc}
create_constraint_mode -name typ_mode -sdc_files {../genus/Genus_Results/MMMC/Genus_Out_Innovus/I2CAndMemory.typ_mode.sdc ../genus/Genus_Results/MMMC/Genus_Out_Innovus/I2CAndMemory.PVT_1_80_V_TYP_VIEW_latency.sdc}
create_constraint_mode -name wc_mode -sdc_files {../genus/Genus_Results/MMMC/Genus_Out_Innovus/I2CAndMemory.wc_mode.sdc ../genus/Genus_Results/MMMC/Genus_Out_Innovus/I2CAndMemory.PVT_1_80_V_WC_VIEW_latency.sdc}
create_delay_corner -name PVT_1_80_V_BC_DELAY -library_set {PVT_1_80_V_BC_LIBS} -rc_corner {MIN_RC}
create_delay_corner -name PVT_1_80_V_TYP_DELAY -library_set {PVT_1_80_V_TYP_LIBS} -rc_corner {TYP_RC}
create_delay_corner -name PVT_1_80_V_WC_DELAY -library_set {PVT_1_80_V_WC_LIBS} -rc_corner {MAX_RC}
create_analysis_view -name PVT_1_80_V_BC_VIEW -constraint_mode {bc_mode} -delay_corner {PVT_1_80_V_BC_DELAY}
create_analysis_view -name PVT_1_80_V_TYP_VIEW -constraint_mode {typ_mode} -delay_corner {PVT_1_80_V_TYP_DELAY}
create_analysis_view -name PVT_1_80_V_WC_VIEW -constraint_mode {wc_mode} -delay_corner {PVT_1_80_V_WC_DELAY}
set_analysis_view -setup {PVT_1_80_V_WC_VIEW PVT_1_80_V_TYP_VIEW} -hold {PVT_1_80_V_BC_VIEW PVT_1_80_V_TYP_VIEW}

