# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.15-s080_1 on Tue Nov 25 22:24:41 EET 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design I2CAndMemory

create_clock -name "clk" -period 125.0 -waveform {0.0 65.5} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[30][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[30][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[29][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[29][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[28][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[28][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[27][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[27][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[26][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[26][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[25][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[25][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[24][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[24][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[23][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[23][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[22][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[22][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[21][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[21][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[20][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[20][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[19][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[19][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[18][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[18][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[17][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[17][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[16][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[16][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[15][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[15][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[14][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[14][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[13][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[13][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[12][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[12][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[11][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[11][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[10][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[10][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[9][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[9][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[8][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[8][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[7][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[7][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[6][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[6][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[5][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[5][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[4][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[4][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[3][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[3][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[2][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[2][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[1][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[1][0]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][7]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][7]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][6]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][6]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][5]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][5]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][4]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][4]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][3]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][3]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][2]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][2]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][1]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][1]}]
set_load -pin_load -min 0.05 [get_ports {DAC_out[0][0]}]
set_load -pin_load -max 0.5 [get_ports {DAC_out[0][0]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[2][2]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[2][2]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[2][1]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[2][1]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[2][0]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[2][0]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[1][2]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[1][2]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[1][1]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[1][1]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[1][0]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[1][0]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[0][2]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[0][2]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[0][1]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[0][1]}]
set_load -pin_load -min 0.05 [get_ports {CS_control[0][0]}]
set_load -pin_load -max 0.5 [get_ports {CS_control[0][0]}]
set_load -pin_load -min 0.05 [get_ports {CP_reset[2]}]
set_load -pin_load -max 0.5 [get_ports {CP_reset[2]}]
set_load -pin_load -min 0.05 [get_ports {CP_reset[1]}]
set_load -pin_load -max 0.5 [get_ports {CP_reset[1]}]
set_load -pin_load -min 0.05 [get_ports {CP_reset[0]}]
set_load -pin_load -max 0.5 [get_ports {CP_reset[0]}]
set_load -pin_load -min 0.05 [get_ports {Timer_EN[2]}]
set_load -pin_load -max 0.5 [get_ports {Timer_EN[2]}]
set_load -pin_load -min 0.05 [get_ports {Timer_EN[1]}]
set_load -pin_load -max 0.5 [get_ports {Timer_EN[1]}]
set_load -pin_load -min 0.05 [get_ports {Timer_EN[0]}]
set_load -pin_load -max 0.5 [get_ports {Timer_EN[0]}]
set_load -pin_load -min 0.05 [get_ports {Timer_FEN[2]}]
set_load -pin_load -max 0.5 [get_ports {Timer_FEN[2]}]
set_load -pin_load -min 0.05 [get_ports {Timer_FEN[1]}]
set_load -pin_load -max 0.5 [get_ports {Timer_FEN[1]}]
set_load -pin_load -min 0.05 [get_ports {Timer_FEN[0]}]
set_load -pin_load -max 0.5 [get_ports {Timer_FEN[0]}]
set_load -pin_load -min 0.05 [get_ports {Amp_EN[2]}]
set_load -pin_load -max 0.5 [get_ports {Amp_EN[2]}]
set_load -pin_load -min 0.05 [get_ports {Amp_EN[1]}]
set_load -pin_load -max 0.5 [get_ports {Amp_EN[1]}]
set_load -pin_load -min 0.05 [get_ports {Amp_EN[0]}]
set_load -pin_load -max 0.5 [get_ports {Amp_EN[0]}]
set_load -pin_load -min 0.05 [get_ports SDA]
set_load -pin_load -max 0.5 [get_ports SDA]
set_clock_gating_check -setup 0.0 
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[30][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[29][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[28][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[27][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[26][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[25][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[24][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[23][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[22][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[21][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[20][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[19][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[18][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[17][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[16][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[15][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[14][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[13][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[12][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[11][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[10][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[9][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[8][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[7][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[6][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[5][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[4][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[3][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[2][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[1][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {DAC_out[0][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[2][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[2][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[2][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[1][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[1][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[1][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[0][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[0][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CS_control[0][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CP_reset[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CP_reset[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {CP_reset[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Timer_EN[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Timer_EN[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Timer_EN[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Timer_FEN[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Timer_FEN[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Timer_FEN[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Amp_EN[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Amp_EN[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {Amp_EN[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports SDA]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports SDA]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[30][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[29][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[28][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[27][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[26][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[25][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[24][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[23][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[22][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[21][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[20][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[19][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[18][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[17][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[16][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[15][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[14][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[13][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[12][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[11][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[10][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[9][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[8][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[7][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[6][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[5][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[4][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[3][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[2][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[1][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][7]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][6]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][5]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][4]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][3]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {DAC_out[0][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[2][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[2][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[2][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[1][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[1][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[1][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[0][2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[0][1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CS_control[0][0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CP_reset[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CP_reset[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {CP_reset[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Timer_EN[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Timer_EN[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Timer_EN[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Timer_FEN[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Timer_FEN[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Timer_FEN[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Amp_EN[2]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Amp_EN[1]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {Amp_EN[0]}]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports SDA]
set_output_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports SDA]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports SCL]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports A_0]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports A_1]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports A_2]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][7]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][6]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][5]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][4]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][3]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][2]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][1]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[2][0]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][7]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][6]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][5]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][4]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][3]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][2]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][1]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[1][0]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][7]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][6]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][5]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][4]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][3]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][2]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][1]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports {ADC_in[0][0]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports SDA]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -max 1.5 [get_ports SDA]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports SCL]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports A_0]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports A_1]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports A_2]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][7]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][6]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][5]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][4]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][3]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][2]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][1]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[2][0]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][7]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][6]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][5]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][4]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][3]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][2]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][1]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[1][0]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][7]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][6]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][5]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][4]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][3]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][2]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][1]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports {ADC_in[0][0]}]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports SDA]
set_input_delay -clock [get_clocks clk] -network_latency_included -add_delay -min 0.5 [get_ports SDA]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports rst_n]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports rst_n]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports SCL]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports SCL]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports A_0]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports A_0]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports A_1]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports A_1]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports A_2]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports A_2]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][7]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][7]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][6]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][6]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][5]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][5]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][4]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][4]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][3]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][3]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][2]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][2]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][1]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][1]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][0]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[2][0]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][7]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][7]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][6]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][6]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][5]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][5]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][4]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][4]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][3]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][3]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][2]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][2]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][1]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][1]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][0]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[1][0]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][7]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][7]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][6]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][6]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][5]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][5]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][4]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][4]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][3]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][3]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][2]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][2]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][1]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][1]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][0]}]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports {ADC_in[0][0]}]
set_driving_cell -min -lib_cell BUHDX12 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports SDA]
set_driving_cell -max -lib_cell BUHDX2 -library D_CELLS_HD_LPMOS_slow_1_62V_175C -pin "Q" [get_ports SDA]
set_clock_uncertainty -setup 0.08 [get_clocks clk]
set_clock_uncertainty -hold 0.08 [get_clocks clk]
